#include "当康.h"

引入 当康::基础类;
引入 当康::包装类;
引入 当康::开发者;

命名空间 当康 {
命名空间 图形处理 {

类定义(当康::图形处理::像素点2D)

像素点2D& 像素点2D::构造() {
	返回 本体;
}

void 像素点2D::析构() {

}

像素点2D& 像素点2D::构造(i32 x, i32 y) {
	返回 本体;
}

像素点2D& 像素点2D::复制构造(只读 像素点2D &其他实例) {
	设置坐标(其他实例.x, 其他实例.y);
	返回 本体;
}

像素点2D& 像素点2D::移动构造(像素点2D &&其他实例) {
	设置坐标(其他实例.x, 其他实例.y);
	删除 &其他实例;
	返回 本体;
}

i32 像素点2D::获取x() 只读 {
	返回 x;
}

i32 像素点2D::获取y() 只读 {
	返回 y;
}

void 像素点2D::获取坐标(i32 &x, i32 &y) 只读 {
	x = this->x;
	y = this->y;
}

void 像素点2D::设置x(i32 x) {
	this->x = x;
}

void 像素点2D::设置y(i32 y) {
	this->y = y;
}

void 像素点2D::设置坐标(i32 x, i32 y) {
	this->x = x;
	this->y = y;
}

void 像素点2D::移动(i32 dx, i32 dy) {
	this->x += dx;
	this->y += dy;
}

void 像素点2D::旋转(f32 角度) {
}

void 像素点2D::绕点旋转(像素点2D &点, f32 角度) {
}

}
}
