#pragma once

#include "定义.h"

命名空间 当康 {

模板<类 E>
void 交换(E &a, E &b) {
	E temp = a;
	a = b;
	b = temp;
}

模板<类 E>
void 复制(只读 E *源, E *目标, i32 元素大小, i32 元素个数) {
	只读 u8 *p1 = (只读 u8*) 源;
	u8 *p2 = (u8*) 目标;

	for (i32 i = 0; i < 元素个数; i++) {
		for (i32 j = 0; j < 元素大小; j++) {
			*p2 = *p1;
			p1++;
			p2++;
		}
	}
}

模板<类 E>
void 复制(只读 E *源, E *目标, i32 元素个数) {
	复制(源, 目标, 取字节数(E), 元素个数);
}

模板<类 E>
void 复制(只读 E *源, E *目标) {
	复制(源, 目标, 1);
}

模板<类 E>
void 移动(E *源, E *目标, i32 元素个数) {
	复制(源, 目标, 元素个数);
	删除[] 源;
}

}
