#include "当康.h"

引入 当康::基础类;
引入 当康::包装类;
引入 当康::开发者;

命名空间 当康 {
命名空间 图形处理 {

类定义(当康::图形处理::画笔)

画笔& 画笔::构造() {
	返回 本体;
}

void 画笔::析构() {

}

画笔& 画笔::构造(画布 *现有画布) {
	设置画布(现有画布);
	返回 本体;
}

画笔& 画笔::复制构造(只读 画笔 &其他实例) {
	返回 本体;
}

画笔& 画笔::移动构造(画笔 &&其他实例) {
	返回 本体;
}

只读 画布& 画笔::获取画布() 只读 {
	返回 *持有画布;
}

void 画笔::设置画布(画布 *现有画布) {
	持有画布 = 现有画布;
}

只读 颜色& 画笔::获取画笔颜色() 只读 {
	返回 当前颜色;
}

void 画笔::设置画笔颜色(只读 颜色 &颜色) {
	当前颜色 = 颜色;
}

只读 字体& 画笔::获取字体() 只读 {
	返回 当前字体;
}

void 画笔::设置字体(只读 字体 &字体) {
	当前字体 = 字体;
}

void 画笔::绘制像素点(i32 x, i32 y) {
	返回 持有画布->绘制像素点(x, y, 当前颜色.获取颜色值());
}

void 画笔::绘制像素点(只读 像素点2D &点) {
	返回 绘制像素点(点.获取x(), 点.获取y());
}

颜色 画笔::获取像素点(i32 x, i32 y) {
	返回 持有画布->获取像素点(x, y);
}

颜色 画笔::获取像素点(只读 像素点2D &点) {
	返回 获取像素点(点.获取x(), 点.获取y());
}

void 画笔::绘制线段(i32 x0, i32 y0, i32 x1, i32 y1) {
}

void 画笔::绘制线段(只读 像素点2D &点A, 只读 像素点2D &点B) {
}

void 画笔::绘制矩形(i32 x, i32 y, i32 宽度, i32 高度) {
}

void 画笔::绘制矩形(只读 矩形2D &矩形) {
}

void 画笔::绘制三角形(i32 x0, i32 y0, i32 x1, i32 y1, i32 x2, i32 y2) {
}

void 画笔::绘制三角形(只读 三角形2D &三角形) {
}

void 画笔::绘制折线(i32 *x, i32 *y, i32 n) {
}

void 画笔::绘制折线(只读 折线2D &折线) {
}

void 画笔::绘制多边形(i32 *x, i32 *y, i32 n) {
}

void 画笔::绘制多边形(只读 多边形2D &多边形) {
}

void 画笔::绘制圆弧(i32 x, i32 y, i32 宽度, i32 高度, f64 起始角度, f64 结束角度) {
}

void 画笔::绘制圆弧(只读 圆弧2D &圆弧) {
}

void 画笔::绘制扇形(i32 x, i32 y, i32 宽度, i32 高度, f64 起始角度, f64 结束角度) {
}

void 画笔::绘制扇形(只读 扇形2D &扇形) {
}

void 画笔::绘制椭圆形(i32 x, i32 y, i32 宽度, i32 高度) {
}

void 画笔::绘制椭圆形(只读 椭圆形2D &椭圆形) {
}

void 画笔::绘制圆角矩形(i32 x, i32 y, i32 宽度, i32 高度, i32 圆角半径) {
}

void 画笔::绘制圆角矩形(只读 圆角矩形2D &圆角矩形) {
}

void 画笔::填充矩形(i32 x, i32 y, i32 宽度, i32 高度) {
}

void 画笔::填充矩形(只读 矩形2D &矩形) {
}

void 画笔::填充三角形(i32 x0, i32 y0, i32 x1, i32 y1, i32 x2, i32 y2) {
}

void 画笔::填充三角形(只读 三角形2D &三角形) {
}

void 画笔::填充多边形(i32 *x, i32 *y, i32 n) {
}

void 画笔::填充多边形(只读 多边形2D &多边形) {
}

void 画笔::填充扇形(i32 x, i32 y, i32 宽度, i32 高度, f64 起始角度, f64 结束角度) {
}

void 画笔::填充扇形(只读 扇形2D &扇形) {
}

void 画笔::填充椭圆形(i32 x, i32 y, i32 宽度, i32 高度) {
}

void 画笔::填充椭圆形(只读 椭圆形2D &椭圆形) {
}

void 画笔::填充圆角矩形(i32 x, i32 y, i32 宽度, i32 高度, i32 圆角半径) {
}

void 画笔::填充圆角矩形(只读 圆角矩形2D &圆角矩形) {
}

void 画笔::绘制字符(i32 x, i32 y, i32 宽度, i32 高度, i32 字符代码) {
}

void 画笔::绘制字符(只读 矩形2D &限制框, i32 字符代码) {
}

void 画笔::绘制字符串(i32 x, i32 y, i32 宽度, i32 高度, 只读 基础类::字符串 &字符串) {
}

void 画笔::绘制字符串(只读 矩形2D &限制框, 只读 基础类::字符串 &字符串) {
}

void 画笔::绘制图片(i32 x0, i32 y0, i32 宽度, i32 高度, 图片 *图片) {
	循环 (i32 y = 0; y < 高度; y++)
		循环 (i32 x = 0; x < 宽度; x++) {
			本元->持有画布->绘制像素点(x0 + x, y0 + y, 图片->获取像素点(x, y).获取颜色值());
		}
}

void 画笔::绘制图片(只读 矩形2D &限制框, 图片 *图片) {
	返回 绘制图片(限制框.获取x(), 限制框.获取y(), 限制框.获取宽度(), 限制框.获取高度(), 图片);
}

}
}
