#include "当康.h"

using namespace 当康::基础类;
using namespace 当康::包装类;
using namespace 当康::开发者;

using namespace 当康::图形处理;
using namespace 当康::图形界面;

i32 图形处理_画笔_测试(i32 参数个数, c8 **参数列表) {
	(void) 参数个数;
	(void) 参数列表;

	屏幕 *屏 = new 屏幕_SDL2("SDL2_液晶屏模拟器 作者:legion", 800, 600, 32, 图形::不旋转);
	画笔 *笔 = new 画笔(屏);

//	笔->设置颜色(颜色::黑色);
//	笔->填充矩形(0, 0, 80, 60);
	笔->设置颜色(颜色::绿色);
//	笔->绘制矩形(10, 10, 200, 100);
//	笔->绘制三角形(100, 10, 20, 100, 300, 200);
	笔->绘制圆弧(200, 200, 200, 100, 0, 90);
	//笔->绘制椭圆形(100, 100, 200, 200);
	屏->刷新();

	while (1)
		屏->刷新();

	return 0;
}
